Table of Contents
 Enum ValueTypec0
Namespace
IdeaRS.OpenModel.Concrete
Assembly
IdeaRS.OpenModel.dll
Define type of c0 value
public enum ValueTypec0
Fields
ConstantDistributionMoment = 1
Value depends on constant distribution of moment
ParabolicDistributionMoment = 2
Value depends on parabolic distribution of moment
TriangularDistributionMoment = 3
Value depends on triangular distribution of moment
UserDefined = 0
Value is inputed by user
Fields
 Name |  Description
 ConstantDistributionMoment = 1
Value depends on constant distribution of moment
 ParabolicDistributionMoment = 2
Value depends on parabolic distribution of moment
 TriangularDistributionMoment = 3
Value depends on triangular distribution of moment
 UserDefined = 0
Value is inputed by user
 Edit this page